nwpTest_2500VusCount.yml
config:
  target: 'https://www.ons.gov.uk/'
  engines:
    playwright: {}
  processor: ./tests/artillery/nwpArtillery.spec.js
  phases:
    # 2500 users count for 5 min
    - name: # 2500 users count for 10 mins 
      duration: 600       #Run test for 10 minutes
      arrivalCount: 2500   #Fixed count of 2500 users total
scenarios:
  - engine: playwright
    testFunction: "artilleryScript"